snlkuharlocal/src/DataProcessors/СформироватьБланкПоДокументуСНастройками/СформироватьБланкПоДокументуСНастройками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СформироватьБланкПоДокументуСНастройками</name>
  <attributes>
    <name>Документы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>фактАдрес</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФвключатьНули</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаИзФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>фНеКонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчёта</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСкидокКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзменийУсловийРаботы</name>
    <type>
      <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранениеНастроекБланкаЗаказа/ХранениеНастроекБланкаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранениеНастроекБланкаЗаказа</name>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСкидка</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФизическогоУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>EnumRef.ВидСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбмена77</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШКПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбменаПеремещениями</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <comment>Приоритет для сортировки в отчетах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКратности</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПути</name>
    <comment>Склад для оприходования товара который не доехал, или еще не принят складом</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НеНачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтгрузкиТранзитом</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныйОтдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладБухгалтерии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляРаспределенияЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапретаОтправкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольГрафикаОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДляПеремещений</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НужноПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НужнаТермоусадка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозвратаСКомиссии</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КарантинЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСкладМаркированногоТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтрольКратностиНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКратности</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/СформироватьБланкПоДокументуСНастройками/ObjectModule.bsl
Перем ИмяОтчета;
Перем Макет;
Перем ТД;
Перем ТИ;
Перем КоличествоСкладов;
Перем ТекЦена;
Перем КаталогКартинок;

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	// Шворобей ВЮ 15.11.2023 ++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХранениеНастроекБланкаЗаказа.Ссылка КАК Ссылка,
	|	ХранениеНастроекБланкаЗаказа.ТипЦен КАК ТипЦен,
	|	ХранениеНастроекБланкаЗаказа.ТипЦенСкидка КАК ТипЦенСкидка,
	|	ХранениеНастроекБланкаЗаказа.НеКонтролироватьОстатки КАК НеКонтролироватьОстатки,
	|	ХранениеНастроекБланкаЗаказа.ВыводитьКартинки КАК ВыводитьКартинки,
	|	ХранениеНастроекБланкаЗаказа.ХранилищеНастроек КАК ХранилищеНастроек,
	|	ХранениеНастроекБланкаЗаказа.ИмяНастройки КАК ИмяНастройки,
	|	ХранениеНастроекБланкаЗаказа.ИмяФайла КАК ИмяФайла,
	|	ХранениеНастроекБланкаЗаказа.НеВыгружатьНаСайт КАК НеВыгружатьНаСайт
	|ИЗ
	|	Документ.ХранениеНастроекБланкаЗаказа КАК ХранениеНастроекБланкаЗаказа
	|ГДЕ
	|	ХранениеНастроекБланкаЗаказа.Проведен";
	
	Результат =	Запрос.Выполнить().Выгрузить();  
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрТЧ из Результат цикл
		Попытка
			ОбработатьДокумент(СтрТЧ);
		Исключение
			//++Данилова Е.В. 05.11.2024
			ТекстОшибки = ОписаниеОшибки(); 
			//--Данилова Е.В. 05.11.2024 
			//Феданченков М.С. 10.06.2026 начало
			//наряд 0000001265
			СписокПолучателей = "tp@collant.ru";
			//Феданченков М.С. 10.06.2026 конец
			ТемаПисьма = "Не удалось сфомировать бланк заказа для b2b";
			ТекстПисьма = "Проблемный документ " + Строка(СтрТЧ.Ссылка) + ТекстОшибки;
			СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма, СтрТЧ.Ссылка);	
		КонецПопытки;
	КонецЦикла;
	// Шворобей ВЮ 15.11.2023 ++
	
	ИмяФайла= КаталогВременныхФайлов()+"upload.done";
	Текст = Новый ЗаписьТекста(ИмяФайла,КодировкаТекста.ANSI);
	Текст.Закрыть();
	
	////////// ПАРАМЕТРЫ ТЕСТИРОВАНИЯ ////////////////////////////////////////////////////
	// 	ТестовыйАдрес  = "188.120.225.3";
	//	ТестовыйЛогин  = "collant2_1c";
	//	ТестовыйПароль = "sH2023#collant2!";
	//////////////////////////////////////////////////////////////////////////////////////
	
	////////// БОЕВЫЕ ПАРАМЕТРЫ //////////////////////////////////////////////////////////
	// 	БоевойАдрес  = "185.195.144.104";
	//	БоевойЛогин  = "*%*%*%";
	//	БоевойПароль = "*$*$*$";
	//////////////////////////////////////////////////////////////////////////////////////
	//++Данилова Е.В. 23.10.2024
	//Данилова Е.В. 22.08.2025 HELP-6708 временно
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "185.195.144.104","*%*%*%", "*$*$*$");
	СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", // "185.195.144.104",
		// Ихсанов Д. А. Начало 02.07.2026 Изменение 0000000215 от 24.06.2026 11:55:11: e1cib/data/Документ.Изменение?ref=89690050568f680711f16faa67ac5512
		РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Хост,
		// Ихсанов Д. А. Конец 02.07.2026
		РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Логин,
		РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Пароль);
	// Ихсанов Д. А. Конец  14.10.2025
	//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "www.collant.ru", "*%*%*%", "*$*$*$");
	//--Данилова Е.В. 23.10.2024
	ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайла,"upload.done","blank", СтруктураСоединения.Адрес, СтруктураСоединения.Логин, СтруктураСоединения.Пароль);
	
КонецПроцедуры


// Кухарь А.Ю.  16.05.2023 начало
//
Процедура ОбработатьДокумент (СтрТЧ) экспорт
	
	ПостроительОтчета = новый ПостроительОтчета;
	ПостроительРасшифровки = новый ПостроительОтчета;
	фРазворачиватьПоСкладам = ложь;
	НастроитьПостроитель(ПостроительОтчета,ПостроительРасшифровки);
	НастроитьПостроительПоУмолчанию(ПостроительОтчета);
	
	Если ПостроительОтчета.ИзмеренияСтроки.Найти("ДопПараметрРазмера") = Неопределено тогда
		ПостроительОтчета.ИзмеренияСтроки.Добавить("ДопПараметрРазмера");	
	КонецЕсли;
	
	ОтборПостроителя = СтрТЧ.хранилищеНастроек.получить();		
	ТипЦен = СтрТч.ТипЦен;
	ТипЦен_SALE = СтрТч.ТипЦенСкидка;
	СортироватьПоБрендам = истина;
	фВыводитьКартинки = СтрТч.выводитьКартинки;	
	фНеКонтролироватьОстатки = СтрТЧ.НеКонтролироватьОстатки;
	// Смирнов М.Ю. Начало 20.08.25
	НеВыгружатьНаСайт = СтрТЧ.НеВыгружатьНаСайт;
	// Смирнов М.Ю. Конец 20.08.25
	фВключатьНули = ложь;	
	ИспользоватьЦеныМатрицы = ложь;   
	
	Для каждого СтрокаОтбора из  ОтборПостроителя.элементы цикл;
		//++Данилова Е.В. 03.09.2025 HELP-6899 
		Если НЕ СтрокаОтбора.Использование Тогда
		
			Продолжить; 	
		
		КонецЕсли;
		//--Данилова Е.В. 03.09.2025 
		СписокЗначн = новый списокЗначений;
		Если ТипЗнч(СтрокаОтбора.правоеЗначение) = ТипЗнч(СписокЗначн) тогда;
			Для каждого СтрокаТч из СтрокаОтбора.правоеЗначение цикл
				СписокЗначн.Добавить(СтрокаТч.значение);
			Конеццикла;
			ДобавитьОтборПостроителя(ПостроительОтчета,Строка(СтрокаОтбора.левоеЗначение),СписокЗначн,СтрокаОтбора.видСравнения,Истина);
		Иначе
			ДобавитьОтборПостроителя(ПостроительОтчета,Строка(СтрокаОтбора.левоеЗначение),СтрокаОтбора.правоеЗначение,СтрокаОтбора.видСравнения,Истина);	  
		КонецЕсли;
		
	Конеццикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	ИмяФайлаЗаказа = КаталогВременныхФайлов() + ПолучитьИмяФайлаДанных(СтрТЧ.ИмяФайла);
	ИмяФайлаЗаказаFTP = СтрТЧ.ИмяФайла;
	/////////////////////////////////////////////////////////////////////////////////////////
	
	ПостроительОтчета.Параметры.Вставить("Дата1",НачалоДня(ТекущаяДата()));
	ПостроительОтчета.Параметры.Вставить("Дата2",КонецДня(ТекущаяДата()));	
	
	ПостроительОтчета.Параметры.Вставить("Остаток",1);			
	ПостроительОтчета.Параметры.Вставить("Резерв",-1);	
	
	ПостроительОтчета.Параметры.Вставить("ВключатьНули",фВключатьНули);		
	
	ПостроительОтчета.Выполнить();	
	
	Макет=ПолучитьМакет("Таблица");
	ТД=Новый ТабличныйДокумент;
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Начало");	
	ОблЗаголовок.Параметры.Дата2=ТекущаяДата();
	
	ТД.Вывести(ОблЗаголовок);
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Размер");	
	ТД.Присоединить(ОблЗаголовок);
	
	Результат=ПостроительОтчета.Результат;
	
	// Шворобей ВЮ 15.11.2023 ++
	Если Результат.Пустой() Тогда Возврат; КонецЕсли;
	// Шворобей ВЮ 15.11.2023 ++
	
	МаксЧислоРазмеров=0;	
	ВыборкаРР=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"РазмерныйРяд");
	Пока ВыборкаРР.Следующий() Цикл		
		ВыборкаР=ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Размер");		
		МаксЧислоРазмеров=Макс(ВыборкаР.Количество(),МаксЧислоРазмеров);		
	КонецЦикла; 
	
	ВыборкаСК			=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	КоличествоСкладов	=ВыборкаСК.Количество();
	
	ТИ=Новый ТаблицаЗначений;
	
	ТИ.Колонки.Добавить("Склад");
	Для Сч=1 По МаксЧислоРазмеров Цикл
		ТИ.Колонки.Добавить("Р_"+Сч,ПолучитьОписаниеТиповЧисла(19,0));	
	КонецЦикла;	
	
	ВыборкаМД		= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
	ВсегоМоделей	= ВыборкаМД.Количество();	
	
	ФиксацияСверху	= ТД.ВысотаТаблицы;	
	
	ТС=СоздатьТаблицуСтрок();
	
	СтрокаТС=ТС.Строки.Добавить();
	
	Если фВыводитьКартинки Тогда
		ТД.Область(,2,,2).ШиринаКолонки=25;
	КонецЕсли;	
	
	ТД.НачатьАвтогруппировкуСтрок();
	
	ВыборкаРР=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Брэнд");
	ВыборкаРР.Сбросить();
	Пока ВыборкаРР.Следующий() Цикл		
		
		ТекРР=ВыборкаРР.РазмерныйРяд;
		
		выборкаБР=ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"РазмерныйРяд");
		
		Пока ВыборкаБР.Следующий() Цикл
			
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"Шапка",МаксЧислоРазмеров),1);
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"Брэнд",МаксЧислоРазмеров),1);
			ТД.Вывести(РазвернутьПоСкладам(ВыборкаБР,"РазмерныйРяд",МаксЧислоРазмеров),2);
			
			СтрокаБ=СтрокаТС.Строки.Добавить();
			СтрокаБ.СтрокаИтога=ТД.ВысотаТаблицы;
			СтрокаБ.ИмяИтога	="РазмерныйРяд";
			
			ВыборкаМД=ВыборкаБР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
			Пока ВыборкаМД.Следующий() Цикл
				
				ВсегоМоделей=ВсегоМоделей-1;
				
				ТекЦена=ЦенаКонтрагента1(ВыборкаМД.Модель,ТипЦен,ТипЦен_SALE);
				
				Если ИспользоватьЦеныМатрицы Тогда
					
					Цена2=ЦенаНоменклатурыПоМатрицеПоМодели(ВыборкаМД.Модель,Контрагент,фактадрес,Дата2);
					ТекЦена = Цена2;
					
				КонецЕсли;
				
				ТД.Вывести(РазвернутьПоСкладам(ВыборкаМД,"Модель",МаксЧислоРазмеров),2+ВыборкаМД.Уровень());			
				
				СтрокаМ=СтрокаБ.Строки.Добавить();
				СтрокаМ.СтрокаИтога=ТД.ВысотаТаблицы;
				СтрокаМ.ИмяИтога	="Модель";
				
				ВыборкаПростоЦвет=ВыборкаМД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Цвет");
				пока ВыборкаПростоЦвет.Следующий() цикл
					ВыборкаЦВ=ВыборкаПростоЦвет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДопПараметрРазмера");			 
					
					Пока ВыборкаЦВ.Следующий() Цикл
						ТекОбласть=РазвернутьПоСкладам(ВыборкаЦВ,"Цвет",МаксЧислоРазмеров);
						ТД.Вывести(ТекОбласть,3+ВыборкаМД.Уровень());			
						
						СтрокаЦ=СтрокаМ.Строки.Добавить();
						СтрокаЦ.СтрокаИтога	=ТД.ВысотаТаблицы;
						СтрокаЦ.ИмяИтога	="Цвет";					
					КонецЦикла; 
				КонецЦикла;
				
				Если фВыводитьКартинки Тогда
					
					ВыборкаПростоЦвет.Сбросить();
					ВыборкаПростоЦвет.Следующий();
					ТекОбласть=РазвернутьПоСкладам(ВыборкаПростоЦвет,"Картинка",МаксЧислоРазмеров);
					
					Пока ТД.ВысотаТаблицы-СтрокаМ.СтрокаИтога<11 Цикл					
						ТД.Вывести(ТекОбласть);
						
						ТекОбласть.Область().ГраницаСверху=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
					КонецЦикла;				
					
					ФайлКартинки=Новый Файл(КаталогКартинок+ВыборкаМД.Модель.Код+".jpg");
					Если ФайлКартинки.Существует() Тогда
						Рисунок				= ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);					
						Рисунок.РазмерКартинки	=РазмерКартинки.реальныйразмер;
						Рисунок.Картинка 	= Новый Картинка(ФайлКартинки.ПолноеИмя);
						Рисунок.Расположить(ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы));   
						
						// Андреев И.Д. 04.09.2024 начало
						//
						
						ОбластьКартинка = ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
						ОбластьКартинка.Картинка = Новый Картинка(ФайлКартинки.ПолноеИмя, Истина);
						//// вторую картинку вставляем в ту же область
						
						//ОбластьКартинка2.Верх = 1;
						//ОбластьКартинка2.Высота = 90;
						//ОбластьКартинка2.Ширина = 90;
						//ОбластьКартинка2.Лево = 1;
						
						Если ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ПустаяДата()и ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой<текущаяДата() тогда
							ОбластьКартинка2 = ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
							ОбластьКартинка2.ЦветФона = Новый Цвет();
							ОбластьКартинка2.ГраницаСверху = Ложь;
							ОбластьКартинка2.ГраницаСлева = Ложь;
							ОбластьКартинка2.ГраницаСнизу = Ложь;
							ОбластьКартинка2.ГраницаСправа = Ложь;
							ОбластьКартинка2.РазмерКартинки = РазмерКартинки.Растянуть;
							ОбластьКартинка2.Картинка = макет.области.КартинкачестныйЗнак.картинка;
							ОбластьКартинка2.Расположить(ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы));
						КонецЕсли;
						
						// Андреев И.Д. 06.08.2024 конец
					 иначе
						 
						 Если ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ПустаяДата() и ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой<текущаяДата() тогда
							ОбластьКартинкапустая = ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
							ОбластьКартинкапустая.ЦветФона = Новый Цвет();
							ОбластьКартинкапустая.ГраницаСверху = Ложь;
							ОбластьКартинкапустая.ГраницаСлева = Ложь;
							ОбластьКартинкапустая.ГраницаСнизу = Ложь;
							ОбластьКартинкапустая.ГраницаСправа = Ложь;
							ОбластьКартинкапустая.РазмерКартинки = РазмерКартинки.Растянуть;
							ОбластьКартинкапустая.Картинка = макет.области.КартинкаПустаяЧестныйЗнак.картинка;
							ОбластьКартинкапустая.Расположить(ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы));
							
						КонецЕсли; 
					 КонецЕсли;
				иначе
					Если ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ПустаяДата() и ВыборкаМД.модель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой<текущаяДата() тогда
						ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы).Объединить();
						ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы).Текст = "Подлежит"+символы.ПС+"маркировке";
						ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы).ВертикальноеПоложение = ВертикальноеПоложение.Центр;
						// Андреев И.Д. 20.08.2024 начало
						ТД.Область(СтрокаМ.СтрокаИтога+1,2,ТД.ВысотаТаблицы).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
						// Андреев И.Д. 20.08.2024 конец
						
					конецЕсли;

					// Андреев И.Д. 04.09.2024 конец
					
				КонецЕсли;				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
	ТД.ЗакончитьАвтогруппировкуСтрок();	
	
	Выборка=Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ТД.Вывести(РазвернутьПоСкладам(Выборка,"Итого",МаксЧислоРазмеров));	
	КонецЕсли; 	
	
	СтрокаТС.СтрокаИтога=ТД.ВысотаТаблицы;
	
	Если ПустаяСтрока(ИмяФайлаЗаказа) Тогда
		Возврат;	
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	ТД.Записать(ИмяФайлаЗаказа,ТипФайлаТабличногоДокумента.XLSX);
	/////////////////////////////////////////////////////////////////////////////////////////
	
	Ексель=Новый COMОбъект("Excel.Application"); 	
	Книга=Ексель.WorkBooks.Open(ИмяФайлаЗаказа);
	Лист=Книга.WorkSheets(1);
	
	// Кухарь А.Ю.  24.08.2023 начало
	// Говорят висит у пользователей, если список страниц не отображать.
	Ексель.ActiveWindow.DisplayWorkbookTabs = 1; 
	Ексель.ActiveWindow.TabRatio = 0.6;        
	// Кухарь А.Ю.  24.08.2023 конец
	
	
	//Состояние("Запись кодов номенклатуры.....");
	ПрописатьКодыТоваров(ТД,Ексель,Книга,Лист);
	
	//Состояние("Запись формул.....");
	ПрописатьФормулы(ТД,Лист,ТС.Строки,МаксЧислоРазмеров);
	
	Для кол = 1 по 100 Цикл
		Если Лист.Cells(9, кол).Value = 0 и Лев(Лист.Cells(9, кол).NumberFormat,5) ="# ##0" Тогда
			Ф = СтрЗаменить(Лист.Cells(9, кол).NumberFormat,"# ##0", "");
			ДлинаФ = стрДлина(Ф);
			Значение = "0"+Прав(Лев(Ф, ДлинаФ-1),ДлинаФ-2);
			Лист.Cells(9, кол).NumberFormat = "Основной";
			Лист.Cells(9, кол).Value = Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Ексель.ActiveWindow.DisplayZeros	=0;
	Ексель.ActiveWindow.DisplayGridlines=0;
	Лист.Outline.SummaryRow = 0;
	Лист.Protect("Victory09051945",1,1,1,0,0,1,1,0,0,0,0,0,0,1,0);
	
	Книга.Save();	
	Ексель.Quit();
	
	/////////////////////////////////////////////////////////////////////////////////////////
	// ЗАПИСАЛИ ФАЙЛИК В КАТАЛОГ ВРЕМЕННЫХ ФАЙЛОВ
	/////////////////////////////////////////////////////////////////////////////////////////
	
	Файл = Новый Файл(ИмяФайлаЗаказа);  // ОБРАБАТЫВАЕМ ВРЕМЕННЫЙ ФАЙЛ
	КраткоеИмя = Файл.Имя;
	
	Попытка
		КопироватьФайл(ИмяФайлаЗаказа, ИмяФайлаЗаказаFTP);
	Исключение
		ЗаписатьВЛог("b2b", "Не могу скопировать файл " + КраткоеИмя + ". Возможно, файл открыт!!!",,,);
	КонецПопытки;
	
	/////////////////////////////////////////////////////////////////////////////////////////
	
	// Смирнов М.Ю. Начало 20.08.25
	Если Не НеВыгружатьНаСайт Тогда
	// Смирнов М.Ю. Конец 20.08.25
	
		ФайлFTP = Новый Файл(ИмяФайлаЗаказаFTP);
		
		ПоследнийСлеш=СтрНайти(ФайлFTP.Путь, "\", НаправлениеПоиска.СКонца,,2);
		ПапкаРодитель=Сред(ФайлFTP.Путь, ПоследнийСлеш+1);
		ПапкаРодитель=СтрЗаменить(ПапкаРодитель,"\","");
		
		/////////////////////////////////////////////////////////////////////////////////////////
		//ТестовыйАдрес  = "188.120.225.3";
		//ТестовыйЛогин  = "collant2_1c";
		//ТестовыйПароль = "sH2023#collant2!";
		/////////////////////////////////////////////////////////////////////////////////////////
		
		////////// БОЕВЫЕ ПАРАМЕТРЫ /////////////////////////////////////////////////////////////
		// 	БоевойАдрес  = "185.195.144.104";
		//	БоевойЛогин  = "1c_collant";
		//	БоевойПароль = "xUTThv3rcYAyAoCkpr";
		/////////////////////////////////////////////////////////////////////////////////////////
		//++Данилова Е.В. 23.10.2024 
		//Данилова Е.В. 25.08.2025 HELP-6708   временно
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "185.195.144.104","*%*%*%", "*$*$*$");
		СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", // "185.195.144.104",
			// Ихсанов Д. А. Начало 02.07.2026 Изменение 0000000215 от 24.06.2026 11:55:11: e1cib/data/Документ.Изменение?ref=89690050568f680711f16faa67ac5512
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Хост,
			// Ихсанов Д. А. Конец 02.07.2026
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Логин,
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Пароль);
		// Ихсанов Д. А. Конец  14.10.2025
		//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "www.collant.ru", "*%*%*%", "*$*$*$");
		//--Данилова Е.В. 23.10.2024
		Если ПроцедурыОбменаССайтом.СоздатьКаталогНаFTP("blank/" + ПапкаРодитель, СтруктураСоединения) Тогда
			ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаЗаказа, КраткоеИмя,"blank/" + ПапкаРодитель,
				СтруктураСоединения.Адрес, СтруктураСоединения.Логин, СтруктураСоединения.Пароль);
		КонецЕсли;
		
	// Смирнов М.Ю. Начало 20.08.25
	КонецЕсли;
	// Смирнов М.Ю. Конец 20.08.25
	
КонецПроцедуры
// Кухарь А.Ю.  16.05.2023 конец


Функция ДобавитьОтборПостроителя(Построитель, ПолеОтбора, ЗначениеОтбора, 
	ВидСравненияСтр = Неопределено, Использование = Истина) Экспорт
	ЗначениеМассивом = Ложь;
	
	СписокЗнач = новый СписокЗначений;
	
	Если ТипЗнч(ЗначениеОтбора) = ТипЗнч(СписокЗнач) тогда;
		МассивЗначений= новый массив;
		
		для каждого СтрТч из  ЗначениеОтбора цикл
			МассивЗначений.Добавить(СтрТч.значение);
		Конеццикла;
	Конецесли;
	
	ЭлементОтбора   = Построитель.Отбор.Добавить(ПолеОтбора);
	ЭлементОтбора.Использование = Использование;
	
	ТипЗначенияОтбора   = ТипЗнч(МассивЗначений);
	ФиксированныйМассив = ТипЗначенияОтбора = Тип("ФиксированныйМассив");
	ЗначениеМассивом    = ФиксированныйМассив ИЛИ ТипЗначенияОтбора = Тип("Массив");
	Если ЗначениеМассивом И МассивЗначений.Количество() = 1 Тогда
		УстанавливаемоеЗначениеОтбора = ЗначениеОтбора.Получить(0);
		ЗначениеМассивом = Ложь;
	ИначеЕсли ФиксированныйМассив Тогда
		УстанавливаемоеЗначениеОтбора = Новый Массив(МассивЗначений);
	Иначе
		УстанавливаемоеЗначениеОтбора = ЗначениеОтбора;
	КонецЕсли;
	
	ВидСравненияОтбора = ?(ВидСравненияСтр = Неопределено, 
	?(ЗначениеМассивом, "ВСпискеПоИерархии", "Равно"), ВидСравненияСтр);
	
	Если  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии тогда
		ЗначениеМассивом=Истина;
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.ВСпискеПоИерархии;	
		// Кухарь А.Ю.  24.05.2023 начало
		//
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии тогда
		ЗначениеМассивом=Истина;
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.НеВСпискеПоИерархии;	
		
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.НеРавно тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.НеРавно;	
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.НеВИерархии тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.НеВИерархии;	
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.Меньше тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.Меньше;		
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.МеньшеИлиРавно тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.МеньшеИлиРавно;
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.БольшеИлиРавно тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.БольшеИлиРавно;	
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.ВСписке тогда
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.ВСписке;
	иначеЕсли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.НеВСписке тогда
		ЗначениеМассивом=Истина;
		ЭлементОтбора.ВидСравнения  =  ВидСравнения.НеВСписке;			
		// Кухарь А.Ю.  24.05.2023 конец
		
	
	Иначеесли  ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.Равно тогда
		ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
	Иначеесли	ВидСравненияОтбора =  ВидСравненияКомпоновкиДанных.Больше тогда
		ЭлементОтбора.ВидСравнения  = ВидСравнения.Больше;
	Конецесли;
	
	
	
	
	
	
	
	Если ЗначениеМассивом тогда;
		//ЗначениеСписком = Новый СписокЗначений;
		//ЗначениеСписком.ЗагрузитьЗначения(МассивЗначений);
		
		Для каждого Стртч из МассивЗначений цикл  		
			
			ЭлементОтбора.значение.добавить(Стртч);	
		Конеццикла;
		
	Иначе                             
		ЭлементОтбора.значение= УстанавливаемоеЗначениеОтбора;
	КонецЕсли;
	
	Возврат ЭлементОтбора;
	
КонецФункции	

Функция РазвернутьПоСкладам(Выборка,ИмяСекции,МаксЧислоРазмеров)	
	ОблИтог=Новый ТабличныйДокумент;
	
	ОблНачало=Макет.ПолучитьОбласть(ИмяСекции+"|Начало");
	ОблНачало.Параметры.Заполнить(Выборка);
	//крохин начало 02.03.2012
	Если ИмяСекции="Цвет" Тогда
		Если Не ПустаяСтрока(Выборка.Цвет.РусскоеНаименование) Тогда
			ОблНачало.Параметры.ЦветРусскоеНаименование="("+Выборка.Цвет.РусскоеНаименование+")";
		КонецЕсли;
	КонецЕсли;
	//крохин конец 02.03.2012
	Если ИмяСекции="Модель" Тогда			
		Если НЕ ЗначениеЗаполнено(Выборка.Коллекция) Тогда
			ОблНачало.Параметры.Коллекция=Выборка.КоллекцияПредставление;					
		КонецЕсли;
		//Кухарь 19.04.18 начало
		//Под галку выводим ещё 1 поле и кое что меняем
		
		ВыводитьНазваниеТовараДляСайта = ложь;
		если  ВыводитьНазваниеТовараДляСайта тогда
			ОблНачало.Параметры.МодельПредставление=Выборка.модель.названиетоварадлясайта;
			ОблНачало.Параметры.КодПроизводителя=Выборка.модель.РусскоеНаименование;
			ОблНачало.область(1,2,1,2).шрифт=новый Шрифт("Arial",10,Истина);
		КонецЕсли;
		//Кухарь 19.04.18 конец
		
	КонецЕсли; 
	
	ОблИтог.Вывести(ОблНачало);
	фРазворачиватьПоСкладам=ложь;
	Если фРазворачиватьПоСкладам Тогда
		ВыборкаСК	=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад","Все");
		
		Пока ВыборкаСК.Следующий() Цикл			
			Если ВыборкаСК.Склад=Null Тогда Продолжить КонецЕсли;
			Если ИмяСекции="РазмерныйРяд" ИЛИ ИмяСекции="Итого" Тогда			
				СтрокаТИ=ТИ.Найти(ВыборкаСК.Склад,"Склад");			
				Если СтрокаТИ=Неопределено Тогда
					СтрокаТИ=ТИ.Добавить();			
					СтрокаТИ.Склад=ВыборкаСК.Склад;
				КонецЕсли; 
			Иначе
				СтрокаТИ=Неопределено;
			КонецЕсли; 
			
			РазвернутьПоРазмерам(ВыборкаСК,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ);		
			
		КонецЦикла;	
		
		Если КоличествоСкладов>1 Тогда
			Если ИмяСекции="Итого" Тогда
				СтрокаСвертки="";
				Для Сч=1 По МаксЧислоРазмеров Цикл
					СтрокаСвертки=СтрокаСвертки+"Р_"+Сч+",";			
				КонецЦикла; 
				СтрокаСвертки=Лев(СтрокаСвертки,СтрДлина(СтрокаСвертки)-1);
				
				ТИ.Добавить();
				ТИ.Колонки.Добавить("Свертка");
				ТИ.Свернуть("Свертка",СтрокаСвертки);			
				
				СтрокаТИ=ТИ[0];
			КонецЕсли;
			
			РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ,Истина);		
		КонецЕсли;
	Иначе
		РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ);
	КонецЕсли; 
	
	
	Возврат ОблИтог;
КонецФункции // РазвернутьПоСкладам()


Функция ЦенаКонтрагента1(Номенклатура,ТипЦен,ТипЦен_SALE)
	
	ТекТипЦен			= ТипЦен;
	Распродажа			= Ложь;
	Скидка=0;
	//--------------------------------------------------------------
	//                   с учетом скидок 
	//--------------------------------------------------------------
	Если НЕ Контрагент.Пустая() Тогда
		
		СкидкаВЫб=СкидкаКонтрагента1(Номенклатура,Контрагент);
		Если  СкидкаВыб=Неопределено Тогда
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			Если СкидкаКонтрагента>0 Тогда
				
				Скидка=СкидкаКонтрагента;
				ТекТипЦен=ПолучитьРеквизитРодителя(Контрагент,"ТипЦен");
				
			КонецЕсли; 
		Иначе
			Скидка=СкидкаВыб.Скидка;
			ТекТипЦен=СкидкаВыб.ТипЦен;
		КонецЕсли; 
		
	КонецЕсли;
	
	
	//Валюта=ТипЦен.Валюта;
	//Курс=ПолучитьКурсВалюты_ПоРусски(Валюта, Дата2);
	//Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,ТипЦен,Валюта,Курс,Дата2);
	
	Дата2=КонецДня(ТекущаяДата());
	
	Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,ТекТипЦен,ТекТипЦен.Валюта,ПолучитьКурсВалюты(ТекТипЦен.Валюта,Дата2).Курс,КонецДня(ТекущаяДата()));
	
	//определение - ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
	Если Цена=Неопределено Тогда
		
		Цена=0;
		
	КонецЕсли; 
	
	
	Если Скидка+0>0 Тогда
		
		Цена=Формат(Цена-(Цена*Скидка/100),"ЧДЦ=2");
		
	КонецЕсли; 
	//крохин начало
	//крохин начало 06.12.2017
	//наценка тоже разрешена
	//Если СкидкаИзФормы+0>0 Тогда
	Если СкидкаИзФормы <> 0 Тогда
		//крохин конец 06.12.2017			
		Цена=Формат(Цена-(Цена*СкидкаИзФормы/100),"ЧДЦ=2");
		
	КонецЕсли; 
	//крохин конец
	
	//-----------------------------------------------------
	
	Если ТипЦен_SALE.Пустая() И НЕ Контрагент.Пустая() Тогда
		ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	КонецЕсли; 
	
	Если НЕ ТипЦен_SALE.Пустая() Тогда
		
		ЦенаРаспродажа=ПолучитьЦенуНоменклатуры(Номенклатура,,ТипЦен_SALE,ТипЦен_SALE.Валюта,ПолучитьКурсВалюты(ТипЦен_SALE.Валюта,Дата2).Курс,КонецДня(ТекущаяДата()));
		//ЦенаКонтрагента(Номенклатура,ТипЦен_SALE);
		Если НЕ ЦенаРаспродажа=Неопределено И ЦенаРаспродажа <> 0 Тогда
			
			Цена=ЦенаРаспродажа;
			ТекТипЦен=ТипЦен_SALE;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Цена;
	
КонецФункции



Функция СоздатьТаблицуСтрок()
	Т=Новый ДеревоЗначений;	
	Т.Колонки.Добавить("СтрокаИтога",ПолучитьОписаниеТиповЧисла(10,0));
	Т.Колонки.Добавить("ИмяИтога");
	Т.Колонки.Добавить("ТаблицаСтрок");
	Возврат Т;
КонецФункции //СоздатьТаблицуСтрок

Процедура ПрописатьФормулы(ТД,Лист,СтрокиТИ,ЧислоРазмеров)
	Перем ФормулаВ,ФормулаГ;
	
	ШиринаСекцииНачало=Макет.ПолучитьОбласть("Заголовок|Начало").ШиринаТаблицы;
	ПозицияГорИтога=ШиринаСекцииНачало+ЧислоРазмеров+1;
	
	ФормулаГ="=SUM(RC[-"+ЧислоРазмеров+"]:RC[-1]";
	Для Каждого СтрокаТИ Из СтрокиТИ Цикл		
		СтрокиДанных=СтрокаТИ.Строки;                             
		Если СтрокиДанных.Количество()>0 Тогда
			ФормулаВ="";
			
			Для Каждого СтрокаДанных Из СтрокиДанных Цикл				
				ФормулаВ=ФормулаВ+?(ПустаяСтрока(ФормулаВ)=1,"","+")+"R"+СтрокаДанных.СтрокаИтога+"C";				
				Лист.Cells(СтрокаДанных.СтрокаИтога,ПозицияГорИтога).FormulaR1C1=ФормулаГ;
				//		Сообщить(ФормулаГ);
			КонецЦикла;						
			
			ФормулаВ="="+ФормулаВ;
			
			НачСмещение=ШиринаСекцииНачало+1;		
			Для Сч=НачСмещение по (НачСмещение+ЧислоРазмеров)-1 Цикл
				Лист.Cells(СтрокаТИ.СтрокаИтога,Сч).FormulaR1C1=ФормулаВ;
				//		Сообщить(ФормулаВ);
				Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога).FormulaR1C1=ФормулаГ;
				//		Сообщить(ФормулаГ);
			КонецЦикла;                                                         
			
			Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога+2).FormulaR1C1=ФормулаВ; //сумма
			//	сообщить(ФормулаВ);
			
			Если СтрокаТИ.ИмяИтога="Модель" Тогда	//сумма 		
				Лист.Cells(СтрокаТИ.СтрокаИтога,ПозицияГорИтога+2).FormulaR1C1="=RC[-2]*RC[-1]";
			КонецЕсли;
			
			ПрописатьФормулы(ТД,Лист,СтрокиДанных,ЧислоРазмеров);
		КонецЕсли;		                              
		
		// Группировка строк
		Если СтрокаТИ.ИмяИтога="Марка" Тогда			
			НачСтрока=СтрокаТИ.СтрокаИтога+1;
			КонСтрока=НачСтрока+СтрокаТИ.Строки.Количество()-1;			
			
			Лист.Rows(""+НачСтрока+":"+КонСтрока).Group();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СкидкаКонтрагента1(Номенклатура,ТипСкидок_Контрагент)
	
	Запрос=Новый Запрос;
	//Запрос.Текст="
	//|ВЫБРАТЬ ПЕРВЫЕ 1		
	//|	Скидка,ТипЦен,
	//|	ВЫБОР 
	//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
	//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
	//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
	//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
	//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
	//// Кухарь А.Ю. 13.10.2022 начало
	////+1 уровень иерархии
	//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
	//// Кухарь А.Ю. 13.10.2022 конец
	//
	//|	ИНАЧЕ 100 
	//|	КОНЕЦ КАК Уровень
	//|ИЗ
	//|	Справочник.Контрагенты.Скидки
	//|ГДЕ
	//|	Ссылка = &Контрагент		
	//|	И Номенклатура В (&СписокПозиций)
	//|УПОРЯДОЧИТЬ ПО Уровень";
	
	// Шворобей ВЮ 05.03.2024 ++
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиКонтрагентов.Скидка КАК Скидка,
	|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
	|			ТОГДА 0
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
	|			ТОГДА 1
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
	|			ТОГДА 2
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
	|			ТОГДА 3
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
	|			ТОГДА 4
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
	|			ТОГДА 5
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
	|	И СкидкиКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень";
	// Шворобей ВЮ 05.03.2024 ++
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
	
	СписокПозиций=Новый Массив;
	
	Уровень=0;		
	ТекРодитель=Номенклатура;
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	//Пока Уровень<5 Цикл
	Пока Уровень<6 Цикл
		// Кухарь А.Ю. 13.10.2022 конец
		
		СписокПозиций.Добавить(ТекРодитель);		
		Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
		
		Уровень=Уровень+1;
		ТекРодитель=ТекРодитель.Родитель;			
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
	
	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		ТипЦенСкидок=Выборка.ТипЦен;
		Возврат  Выборка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЦенаНоменклатурыПоМатрицеПоМодели(Номенклатура,Контрагент,ПунктДоставки=неопределено,ДатаРасчета) 
	
	Если  Номенклатура=Null или Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат или Номенклатура=неопределено Тогда Возврат 0 КонецЕсли;	
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	ДатаРасчетаЦены= Датарасчета;
	Если ПунктДоставки=неопределено тогда ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка() КонецЕсли;
	
	
	//нечаева 11,04,14+++	
	ТекТовар = номенклатура;
	//-----------------------------------------
	ТЗМартицПоФА=новый ТаблицаЗначений;
	//-----------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
	|		СУММА(1) КАК кол,
	|		Матрица.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
	|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
	|	ГДЕ
	|		Матрица.Контрагент = &Контрагент
	|		И Матрица.Дата <= &Дата1
	|		И Матрица.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
	|		И Матрица.Договор = &ТекДоговор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МатрицаПунктыДоставки.ПунктДоставки,
	|		Матрица.Ссылка) КАК ВложенныйЗапрос
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекДоговор",Договор);
	Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
	// цена по акции
	ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
	
	
	//---------------------------------------------
	ЕстьМартицаПоФактАдресу=ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|ГДЕ
	|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
	|	И МатрицаПунктыДоставки.Ссылка.Проведен
	|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
	|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|	И МатрицаПунктыДоставки.Ссылка.Договор = &ТекДоговор
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекДоговор",Договор);
	Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
	// цена по акции
	ТЗМК = Запрос.Выполнить().Выгрузить();
	
	Если ТЗМК.Количество()>0 Тогда
		ЕстьМартицаПоФактАдресу=истина;
	конецЕсли;
	// список значений матриц с пустыми значениями.
	
	
	ТекЦена=0;
	
	Если ЕстьМартицаПоФактАдресу Тогда
		
		//считаем по матрице. для конкретного факт. адреса
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура.родитель как номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &ТекДоговор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура.Родитель = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекДоговор",Договор);
		Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета акции		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура.родитель как номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &ТекДоговор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура.родитель = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекДоговор",Договор);
		Запрос.УстановитьПараметр("ТекПункт",пунктДоставки);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Отбор1 = новый Структура;
		Отбор1.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор1); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор1); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					ТекЦена=СтрокаМатриц.Цена;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				ТекЦена=СтрокаМатриц.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
		
	иначе 
		// берем по матрицам без заполненных факт адресов.
		
		
		ТекТовар = номенклатура;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура.родитель как номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &ТекДоговор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура.родитель = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекДоговор",Договор);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета матрицы.		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура.родитель как номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &ТекДоговор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура.родитель = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекДоговор",Договор);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		
		Отбор1 = новый Структура;
		Отбор1.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор1); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор1); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					конецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				//ТекЦена=СтрокаМатриц.Цена;
				Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
					ТекЦена=СтрокаМатриц.Цена;
					прервать;
				конецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	конецЕсли;
	//нечаева 11,04,14
	
	Возврат ТекЦена;
	
	
КонецФункции

Процедура ПрописатьКодыТоваров(ТД,Ексель,Книга,Лист)
	Для Кол=1 по ТД.ШиринаТаблицы	Цикл
		Для Стр=1 по ТД.ВысотаТаблицы Цикл
			КодТовара=ТД.Область(Стр,Кол,Стр,Кол).Расшифровка;		    
			Если НЕ ПустаяСтрока(КодТовара) Тогда				
				//Состояние("Установка кодов: "+КодТовара);
				Попытка               
					КодПозиции="R"+СтрЗаменить(КодТовара,"-","_____");
					Лист.Cells(Стр,Кол).Name=КодПозиции;
					//крохин начало 16.03.2022
					//для портала  b2b, иначе не читается файл
					//Книга.Names(КодПозиции).Visible=0;
					Книга.Names(КодПозиции).Visible=1;
					//крохин конец 16.03.2022
					Ексель.Evaluate(Книга.Names(КодПозиции).Value).Locked=0;					
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;  	    
	КонецЦикла;
КонецПроцедуры //ПрописатьКодыТоваров

Процедура НастроитьПостроительПоУмолчанию(ПостроительОтчета) Экспорт 
	
	
	ПостроительОтчета.ВыбранныеПоля.Очистить();		
	
	ПостроительОтчета.ВыбранныеПоля.Добавить("КолКон");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ШтукВКоробке");
	ПостроительОтчета.ВыбранныеПоля.Добавить("ШтукВБлочке");
	ПостроительОтчета.ВыбранныеПоля.Добавить("КодПроизводителя");
	ПостроительОтчета.ВыбранныеПоля.Добавить("Коллекция");
	ПостроительОтчета.ВыбранныеПоля.Добавить("КоллекцияПредставление");
	
	ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("РазмерныйРяд",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Брэнд",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Модель",,ТипИзмеренияПостроителяОтчета.Элементы);	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Цвет",,ТипИзмеренияПостроителяОтчета.Элементы);	
	
	ПостроительОтчета.ИзмеренияКолонки.Очистить();
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Склад",,ТипИзмеренияПостроителяОтчета.Элементы);
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Размер",,ТипИзмеренияПостроителяОтчета.Элементы);
	
	
	ОтборКоличество=ПостроительОтчета.Отбор.Количество();
	Для Н = 1 По ОтборКоличество Цикл
		ПостроительОтчета.Отбор.Удалить(ОтборКоличество - Н);
	КонецЦикла;
	
	ПостроительОтчета.Отбор.Добавить("Склад");	
	ПостроительОтчета.Отбор.Добавить("Номенклатура");	
	ПостроительОтчета.Отбор["Номенклатура"].ВидСравнения=ВидСравнения.ВИерархии;
КонецПроцедуры

Процедура НастроитьПостроитель(ПостроительОтчета,ПостроительРасшифровки)
	СортироватьПоРазмернымРядам = ложь;
	Если СортироватьПоРазмернымРядам Тогда	
		
		ПостроительОтчета.Текст="ВЫБРАТЬ
		|	СпрНоменклатура.Родитель.Родитель.Родитель КАК Брэнд,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель.Родитель) КАК БрэндПредставление,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель) КАК КоллекцияПредставление,
		|	СпрНоменклатура.Родитель КАК Модель,
		|	СпрНоменклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	СпрНоменклатура.Родитель.ШтукВКоробочке КАК ШтукВБлочке,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель) КАК МодельПредставление,
		|	СпрНоменклатура.Родитель.КодПроизводителя КАК КодПроизводителя,
		|	СпрНоменклатура.Цвет КАК Цвет,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Цвет) КАК ЦветПредставление,
		|	СпрНоменклатура.Родитель.Коллекция КАК Коллекция,
		|	СпрНоменклатура.Размер.Родитель КАК РазмерныйРяд,
		|	СпрНоменклатура.Размер.Код КАК Размер,
		|	СпрСклады.Ссылка КАК Склад,
		|	&Остаток * ЕСТЬNULL(Остатки.КоличествоОстаток, 0) + &Резерв * ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК КолКон,
		|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК ОстКон,
		|	СпрНоменклатура.СнятСПроизводства КАК СнятСПроизводства,
		|	СпрНоменклатура.ДопПараметрРазмера КАК ДопПараметрРазмера,
		|	СпрНоменклатура.Цвет.Наименование + "" "" + СпрНоменклатура.ДопПараметрРазмера.Наименование КАК ЦветИДопРазмер
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО (1 = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, {(Номенклатура).*, (Склад).*}) КАК Остатки
		|		ПО СпрНоменклатура.Ссылка = Остатки.Номенклатура
		|			И (СпрСклады.Ссылка = Остатки.Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата2, {(Номенклатура).*, (Склад).*}) КАК Резервы
		|		ПО СпрНоменклатура.Ссылка = Резервы.Номенклатура
		|			И (СпрСклады.Ссылка = Резервы.Склад)
		|ГДЕ
		|	НЕ СпрНоменклатура.ЭтоГруппа
		|	И (&ВключатьНули
		|			ИЛИ &Остаток <> 0
		|				И Остатки.КоличествоОстаток ЕСТЬ НЕ NULL 
		|			ИЛИ &Резерв <> 0
		|				И Резервы.КоличествоОстаток ЕСТЬ НЕ NULL )
		|{ГДЕ
		|	СпрНоменклатура.Ссылка.* КАК Номенклатура,
		|	СпрНоменклатура.Родитель.Коллекция КАК Коллекция,
		|	СпрСклады.Ссылка.* КАК Склад}
		|ИТОГИ
		|	СУММА(КолКон)
		|ПО
		|	ОБЩИЕ
		|{ИТОГИ ПО
		|	РазмерныйРяд,
		|	Брэнд,
		|	Модель,
		|	Цвет,
		|	ЦветИДопРазмер,
		|	Размер,
		|	Склад}
		|АВТОУПОРЯДОЧИВАНИЕ"	
		;
	иначе
		ПостроительОтчета.Текст="ВЫБРАТЬ
		|	СпрНоменклатура.Родитель.Родитель.Родитель КАК Брэнд,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель.Родитель) КАК БрэндПредставление,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель.Родитель) КАК КоллекцияПредставление,
		|	СпрНоменклатура.Родитель КАК Модель,
		|	СпрНоменклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	СпрНоменклатура.Родитель.ШтукВКоробочке КАК ШтукВБлочке,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Родитель) КАК МодельПредставление,
		|	СпрНоменклатура.Родитель.КодПроизводителя КАК КодПроизводителя,
		|	СпрНоменклатура.Цвет КАК Цвет,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Цвет) КАК ЦветПредставление,
		|	СпрНоменклатура.Родитель.Коллекция КАК Коллекция,
		|	СпрНоменклатура.Размер.Родитель КАК РазмерныйРяд,
		|	СпрНоменклатура.Размер.Код КАК Размер,
		|	СпрСклады.Ссылка КАК Склад,
		|	&Остаток * ЕСТЬNULL(Остатки.КоличествоОстаток, 0) + &Резерв * ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК КолКон,
		|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК ОстКон,
		|	СпрНоменклатура.СнятСПроизводства КАК СнятСПроизводства,
		|	СпрНоменклатура.ДопПараметрРазмера КАК ДопПараметрРазмера,
		|	СпрНоменклатура.Цвет.Наименование + "" "" + СпрНоменклатура.ДопПараметрРазмера.Наименование КАК ЦветИДопРазмер
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
		|		ПО (1 = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, {(Номенклатура).*, (Склад).*}) КАК Остатки
		|		ПО СпрНоменклатура.Ссылка = Остатки.Номенклатура
		|			И (СпрСклады.Ссылка = Остатки.Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата2, {(Номенклатура).*, (Склад).*}) КАК Резервы
		|		ПО СпрНоменклатура.Ссылка = Резервы.Номенклатура
		|			И (СпрСклады.Ссылка = Резервы.Склад)
		|ГДЕ
		|	НЕ СпрНоменклатура.ЭтоГруппа
		|	И (&ВключатьНули
		|			ИЛИ &Остаток <> 0
		|				И Остатки.КоличествоОстаток ЕСТЬ НЕ NULL 
		|			ИЛИ &Резерв <> 0
		|				И Резервы.КоличествоОстаток ЕСТЬ НЕ NULL )
		|{ГДЕ
		|	СпрНоменклатура.Ссылка.* КАК Номенклатура,
		|	СпрНоменклатура.Родитель.Коллекция КАК Коллекция,
		|	СпрСклады.Ссылка.* КАК Склад}
		|ИТОГИ
		|	СУММА(КолКон)
		|ПО
		|	ОБЩИЕ
		|{ИТОГИ ПО
		|	Брэнд,
		|	РазмерныйРяд,
		|	Модель,
		|	Цвет,
		|	ЦветИДопРазмер,
		|	Размер,
		|	Склад,
		|	ДопПараметрРазмера}
		|АВТОУПОРЯДОЧИВАНИЕ"	
		;
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("Длина",3);
	ПостроительОтчета.ЗаполнитьНастройки();
	ПостроительОтчета.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка;
	ПостроительОтчета.ВыводитьДетальныеЗаписи=Ложь;
	
	ПостроительОтчета.ДобавлениеПредставлений=ТипДобавленияПредставлений.Добавлять;		
	
	ПостроительОтчета.ДоступныеПоля["КолКон"].Представление			="Кол. кон.";
	// Кухарь А.Ю. 26.02.2021 начало
	//
	ПостроительОтчета.ДоступныеПоля["СнятСПРоизводства"].Представление			="Снят с производства";
	// Кухарь А.Ю. 26.02.2021 конец
	
	
	ПостроительРасшифровки.Текст=ПостроительОтчета.Текст;	
	
КонецПроцедуры

Функция РазвернутьПоРазмерам(Выборка,ИмяСекции,МаксЧислоРазмеров,ОблИтог,СтрокаТИ,ИтогПоСтроке=Ложь)
	НачКол=ОблИтог.ШиринаТаблицы;		
	ТекЧислоРазмеров=0;
	
	Если ИмяСекции="Итого" Тогда
		ИмяГруппировкиРР=Неопределено;
	ИначеЕсли ИмяСекции="РазмерныйРяд" Тогда		
		ИмяГруппировкиРР="РазмерныйРяд";
	Иначе
		ИмяГруппировкиРР="РазмерныйРяд";			
	КонецЕсли;	
	
	ВыборкаРМ=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Размер",ИмяГруппировкиРР);	
	
	Пока ВыборкаРМ.Следующий() И ТекЧислоРазмеров<МаксЧислоРазмеров Цикл		
		
		ОблСклад=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
		
		ТекЧислоРазмеров=ТекЧислоРазмеров+1;
		
		ОблСклад.Параметры.Заполнить(ВыборкаРМ);
		
		//крохин начало 17.03.2011
		//поменял упорядочивание размеров со ссылок на коды
		Если ИмяСекции="Шапка" Тогда
			попытка
				ОблСклад.Параметры.Размер = Справочники.Размеры.НайтиПоКоду(ВыборкаРМ.Размер);
				// Кухарь А.Ю. 13.01.2022 начало
				ОблИзменений=ОблСклад.область("РазмерШапка");
				если СтрДлина(Строка(ОблСклад.Параметры.Размер)) > 10 тогда
					ОблИзменений.шрифт = новый Шрифт(ОблИзменений.шрифт,,7);				
				иначеесли СтрДлина(Строка(ОблСклад.Параметры.Размер)) > 8 тогда
					ОблИзменений.шрифт = новый Шрифт(ОблИзменений.шрифт,,8);
				КонецЕсли;				 	
				// Кухарь А.Ю. 13.01.2022 конец
				
				
			исключение
			конецпопытки;
		КонецЕсли;
		//крохин конец
		
		
		Если ИмяСекции="РазмерныйРяд" И НЕ ИтогПоСтроке Тогда	
		ИначеЕсли ИмяСекции="Модель" Тогда			
		ИначеЕсли ИмяСекции="Итого" Тогда			
		ИначеЕсли ИмяСекции="Цвет" Тогда
			ТекОбл=ОблСклад.Область();	
			// Кухарь А.Ю.  09.11.2022 начало
			// 			КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет);
			КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет,ВыборкаРМ.ДопПараметрРазмера);	 
			// Кухарь А.Ю.  09.11.2022 конец
			
			
			Если ПустаяСтрока(КодТовара) Тогда
				ТекОбл.ЦветФона		=Новый Цвет(128,128,128);
			Иначе
				
				// Кухарь А.Ю.  09.11.2022 начало
				// КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет);	
				КодТовара=ПолучитьКодТовара(ВыборкаРМ.Модель,ВыборкаРМ.Размер,ВыборкаРМ.Цвет,ВыборкаРМ.ДопПараметрРазмера);	 
				// Кухарь А.Ю.  09.11.2022 конец
				
				Если ВыборкаРМ.КолКон<>Null И ВыборкаРМ.КолКон>0 Тогда
					ТекОбл.ЦветФона=Новый Цвет(255,255,153);			
					ОблСклад.Параметры.КодТовара=КодТовара;
					//Если фВыводитьКоличество Тогда
					//	ОблСклад.Параметры.Остаток = ВыборкаРМ.КолКон;
					//КонецЕсли;					
				Иначе
					ТекОбл.ЦветФона=Новый Цвет(192,192,192);
					Если фНеКонтролироватьОстатки Тогда
						ОблСклад.Параметры.КодТовара=КодТовара;					
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли; 
		
		ОблИтог.Присоединить(ОблСклад);
	КонецЦикла; 
	
	ОблСклад=Макет.ПолучитьОбласть(ИмяСекции+"|Размер");
	Для Сч=ТекЧислоРазмеров+1 По МаксЧислоРазмеров Цикл
		ОблИтог.Присоединить(ОблСклад);
	КонецЦикла;
	
	Если ИмяСекции="Шапка" Тогда
		ОблСклад=ОблИтог.Область(1,НачКол+1,1,ОблИтог.ШиринаТаблицы);
		ОблСклад.Объединить();
		ОблСклад.Текст					=Выборка.РазмерныйРяд;
		ОблСклад.ВертикальноеПоложение	=ВертикальноеПоложение.Центр;
		ОблСклад.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;	
	КонецЕсли;		
	
	ОблИтого=Макет.ПолучитьОбласть(ИмяСекции+"|Конец");
	ОблИтого.Параметры.Заполнить(Выборка);
	Если ИмяСекции="Модель" Тогда
		ОблИтого.Параметры.Цена=ТекЦена;	
	КонецЕсли;
	
	ОблИтог.Присоединить(ОблИтого);	
КонецФункции // РазвернутьпоРазмерам()

Функция ПолучитьКодТовара(Модель,Размер,Цвет,знач ДопПараметрРазмера)
	// Кухарь А.Ю.  09.11.2022 начало
	//
	если не ЗначениеЗаполнено(ДопПараметрРазмера) тогда
		ДопПараметрРазмера=Справочники.ДопПараметрРазмера.ПустаяСсылка();
	КонецЕсли;
	
	// Кухарь А.Ю.  09.11.2022 конец
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Номенклатура.Ссылка.Код КАК Код80,
	|	Номенклатура.Ссылка.Код77 КАК Код77
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Модель
	|	И Номенклатура.Размер = &Размер
	|	И Номенклатура.Цвет = &Цвет
	|	И Номенклатура.ДопПараметрРазмера = &ДопПараметрРазмера";
	
	Запрос.УстановитьПараметр("Модель",Модель);
	// Кухарь А.Ю.  09.11.2022 начало
	запрос.УстановитьПараметр("ДопПараметрРазмера",ДопПараметрРазмера);	 
	// Кухарь А.Ю.  09.11.2022 конец
	
	
	//крохин начало18.03.2011
	//размер- код размера
	//	Запрос.УстановитьПараметр("Размер",Размер);
	Запрос.УстановитьПараметр("Размер",Справочники.Размеры.НайтиПоКоду(Размер));
	//крохин конец
	Запрос.УстановитьПараметр("Цвет",Цвет);	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Возврат Выборка[фВидКодов];	
		//Возврат Выборка.Код77;
		//Мессерле
		Возврат Выборка.Код80;
		//Мессерле
		
	КонецЦикла; 
	
	Возврат "";
КонецФункции // НайтиТовар()

Процедура ОсновныеДействияФормыОсновныеДействияФормыВыполнить(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Шворобей ВЮ 03.04.2024 ++
Функция ПолучитьИмяФайлаДанных(Знач ПолныйПуть, Слэш = "\")
	
	СтрокаПути = ПолныйПуть;
	
	ПозицияСлэш = Найти(СтрокаПути, Слэш);
	Пока ПозицияСлэш > 0 Цикл
		СтрокаПути = Сред(СтрокаПути, ПозицияСлэш + 1);
		ПозицияСлэш = Найти(СтрокаПути, Слэш);
	КонецЦикла;
	Возврат СтрокаПути;
	
КонецФункции
// Шворобей ВЮ 03.04.2024 ++

КаталогКартинок = Константы.КаталогВнешнихОтчетов.Получить()+"BLANKZAKAZAPictures\";
ИмяОтчета		= Метаданные().Имя;
